Kirishimya/SmartScale-ESP32/src/ScaleManager.cpp
#include "ScaleManager.h"
#include "Calibration.h"
#include <drivers/BLE/BLEStream.h>
#include "PartCounter.h"
#include <math.h>
#include <memory>
#if defined(ESP8266) || defined(ESP32)
#include <EEPROM.h>
#endif

constexpr unsigned long kSerialPrintInterval = 1000;
constexpr float kAutoZeroThreshold = 0.01f;
constexpr unsigned long kAutoZeroStableTime = 1500;
constexpr unsigned long kAutoZeroCooldown = 5000;

ScaleManager::ScaleManager(int dout, int sck, int eepromAddress)
    : _loadCell(dout, sck), _bluetoothStream(nullptr), _lastPrint(0),
      _lastNoDataPrint(0), _newDataReady(false), _eepromAddress(eepromAddress),
      _lastAutoZero(0), _autoZeroStableStart(0), _autoZeroPending(false),
      _sensorReady(false) {
  _calibration = std::make_unique<Calibration>(_loadCell, _eepromAddress);
  _partCounter = std::make_unique<PartCounter>(_loadCell, _eepromAddress);
}

void ScaleManager::begin() {
  Serial.begin(115200);
  _partCounter->loadSavedPieceWeight();
  delay(10);

#if defined(ESP32)
  initializeBluetooth();
#endif

  Serial.println();
  Serial.println("Starting...");

  _loadCell.begin();
  _loadCell.setSamplesInUse(32);
  const unsigned long stabilizingTime = 2000;
  const bool tareAfterStart = true;
  _loadCell.start(stabilizingTime, tareAfterStart);

  constexpr uint8_t kMaxStartAttempts = 3;
  uint8_t attempts = 0;
  while ((_loadCell.getTareTimeoutFlag() || _loadCell.getSignalTimeoutFlag()) &&
         attempts < kMaxStartAttempts) {
    Serial.println("Timeout, check MCU>HX711 wiring and pin designations");
    delay(500);
    _loadCell.start(stabilizingTime, tareAfterStart);
    ++attempts;
  }

  if (_loadCell.getTareTimeoutFlag() || _loadCell.getSignalTimeoutFlag()) {
    Serial.println("ERROR: HX711 startup failed; continuing so network/watchdog can run.");
    _sensorReady = false;
    return;
  }

  float calValue = _calibration->loadSavedFactor();
  if (calValue == 1.0f) {
    Serial.println("No saved calibration found. Using default factor (1.0).");
    Serial.println("Please send 'r' to calibrate.");
  } else {
    Serial.print("Loaded calibration value from EEPROM: ");
    Serial.println(calValue);
  }

  _loadCell.setCalFactor(calValue);
  if (calValue < 0.0f) {
    Serial.println("WARNING: loaded calibration factor is negative.");
    Serial.println("Check load cell wiring, known mass range, and tare procedure.");
  }
  Serial.println("Startup is complete");

  const unsigned long startTimeout = 5000;
  unsigned long startTime = millis();
  Serial.println("Waiting for HX711 data...");
  while (!_loadCell.update()) {
    if (millis() - startTime > startTimeout) {
      Serial.println("ERROR: HX711 did not respond in time.");
      Serial.println("Check DOUT/SCK wiring, power, and load cell connections.");
      break;
    }
  }
  _sensorReady = !_loadCell.getSignalTimeoutFlag();
}

void ScaleManager::initializeBluetooth() {
#if defined(ESP32) && (defined(ESP32C3) || defined(ESP32_C3) || defined(CONFIG_IDF_TARGET_ESP32C3))
  static BLEStream ble;
  ble.begin(kBleDeviceName);
  _bluetoothStream = &ble;
  Serial.println("BLE iniciado. Pronto para parear.");
#elif defined(ESP32)
  static BluetoothSerial bluetooth;
  if (bluetooth.begin("ESP32_Scale")) {
    Serial.println("Bluetooth iniciado. Pronto para parear.");
    _bluetoothStream = &bluetooth;
  }
#endif
}

void ScaleManager::update() {
  if (!_sensorReady && _loadCell.getSignalTimeoutFlag()) {
    return;
  }
  if (_loadCell.update()) {
    _newDataReady = true;
    _sensorReady = true;
  }
}

void ScaleManager::process() {
  handleCommands(Serial);
  if (_bluetoothStream && _bluetoothStream->available() > 0) {
    handleCommands(*_bluetoothStream);
  }

  if (!_sensorReady) {
    if (millis() > _lastNoDataPrint + 5000) {
      Serial.println("HX711 unavailable; runtime remains active.");
      _lastNoDataPrint = millis();
    }
    return;
  }

  if (_newDataReady) {
    maybeAutoZero();
    if (millis() > _lastPrint + kSerialPrintInterval) {
      printWeight();
      _newDataReady = false;
      _lastPrint = millis();
      _lastNoDataPrint = millis();
    }
  }

  if (!_newDataReady && millis() > _lastNoDataPrint + 5000) {
    if (_loadCell.getSignalTimeoutFlag()) {
      Serial.println("No HX711 data: signal timeout detected. Check wiring and power.");
    } else {
      Serial.println("No HX711 data yet. Waiting for sensor to become ready...");
    }
    _lastNoDataPrint = millis();
  }

  if (_loadCell.getTareStatus() == true) {
    printTareStatus();
  }
}

float ScaleManager::currentWeight() {
  if (!_sensorReady) return 0.0f;
  return _loadCell.getData();
}

float ScaleManager::averagePieceWeight() const {
  return _partCounter->getAvgPieceWeight();
}

float ScaleManager::estimatedParts() {
  if (!_sensorReady) return 0.0f;
  return static_cast<float>(_partCounter->estimateParts(_loadCell.getData()));
}

bool ScaleManager::ready() const {
  return _sensorReady;
}

void ScaleManager::maybeAutoZero() {
  if (_loadCell.getTareStatus()) {
    _autoZeroPending = false;
    return;
  }

  const float weight = _loadCell.getData();
  const bool nearZero = fabsf(weight) < kAutoZeroThreshold;

  if (nearZero) {
    if (!_autoZeroPending) {
      _autoZeroPending = true;
      _autoZeroStableStart = millis();
    } else if (millis() - _autoZeroStableStart >= kAutoZeroStableTime &&
               millis() - _lastAutoZero >= kAutoZeroCooldown) {
      _loadCell.tareNoDelay();
      _lastAutoZero = millis();
      _autoZeroPending = false;
      Serial.println("Auto-zero triggered");
    }
  } else {
    _autoZeroPending = false;
  }
}

void ScaleManager::printWeight() {
  float weight = _loadCell.getData();
  float cal = _loadCell.getCalFactor();
  bool tare = _loadCell.getTareStatus();
  int estimatedParts = _partCounter->estimateParts(weight);
  bool hasPieceWeight = _partCounter->hasAvgPieceWeight();

  // Serial diagnostic output
  Serial.print("Raw: ");
  Serial.print((_loadCell.getTareOffset()));
  Serial.print(" | Weight: ");
  Serial.print(weight, 3);
  Serial.print(" kg");
  Serial.print(" | Parts: ");
  if (hasPieceWeight) {
    Serial.print(estimatedParts);
  } else {
    Serial.print("n/a");
  }
  Serial.print(" | Cal: ");
  Serial.print(cal);
  Serial.print(" | Tare: ");
  Serial.print(tare ? 1 : 0);
  Serial.print(" | millis: ");
  Serial.println(millis());

  // Bluetooth/stream JSON output (if available)
  if (_bluetoothStream) {
    _bluetoothStream->print("{\"weight\":");
    _bluetoothStream->print(weight, 3);
    _bluetoothStream->print(",\"estimated_parts\":");
    if (hasPieceWeight) {
      _bluetoothStream->print(estimatedParts);
    } else {
      _bluetoothStream->print("null");
    }
    _bluetoothStream->print(",\"avg_piece_weight\":");
    if (hasPieceWeight) {
      _bluetoothStream->print(_partCounter->getAvgPieceWeight(), 6);
    } else {
      _bluetoothStream->print("null");
    }
    _bluetoothStream->print(",\"tare\":");
    _bluetoothStream->print(tare ? "true" : "false");
    _bluetoothStream->print(",\"millis\":");
    _bluetoothStream->print(millis());
    _bluetoothStream->println("}");
  }
}

void ScaleManager::handleStream(Stream &port) {
  while (port.available() > 0) {
    char inByte = port.read();
    if (inByte == 't') {
      _loadCell.tareNoDelay();
    } else if (inByte == 'r') {
      _calibration->calibrate(port);
    } else if (inByte == 'c') {
      _calibration->changeSavedCalFactor(port);
    } else if (inByte == 'm') {
      // start interactive sampling to compute avg piece weight
      _partCounter->startSample(port);
    } else if (inByte == 'b') {
      _partCounter->startBatch(port);
    } else if (inByte == 'e') {
      _partCounter->endBatch(port);
    }
  }
}

void ScaleManager::handleCommands(Stream &port) {
  while (port.available() > 0) {
    char inByte = port.read();
    if (inByte == 't') {
      _loadCell.tareNoDelay();
    } else if (inByte == 'r' || inByte == 'c' || inByte == 'm' ||
               inByte == 'b' || inByte == 'e') {
      port.println("Interactive calibration/batch commands are disabled in runtime mode.");
    }
  }
}

void ScaleManager::printTareStatus() {
  Serial.println("Tare complete");
  if (_bluetoothStream) {
    _bluetoothStream->println("Tare complete");
  }
}
